---
kind: type
id: T:Autodesk.Revit.DB.PhaseArray
source: html/a60fcff7-0295-3297-8784-ed09da99351a.htm
---
# Autodesk.Revit.DB.PhaseArray

An array that contains phase objects.

## Syntax (C#)
```csharp
public class PhaseArray : APIObject, IEnumerable
```